hw4/rottenpotatoes/app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'PG', 'PG-13', 'NC-17', 'R')
---
  def index
    sort = params[:sort] || session[:sort]
    case sort
    when 'title'
      ordering,@title_header = {:order => :title}, 'hilite'
    when 'release_date'
      ordering,@date_header = {:order => :release_date}, 'hilite'
    end
    @all_ratings = Movie.all_ratings
    @selected_ratings = params[:ratings] || session[:ratings] || {}

    if @selected_ratings == {}
      @selected_ratings = Hash[@all_ratings.map {|rating| [rating, rating]}]

INSERT INTO "movies" ("created_at", "description", "director", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)
---
  def create
    @movie = Movie.create!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT 1  [["id", "3"]]
UPDATE "movies" SET "title" = 'The Lord of The Ring', "director" = 'Peter Jackson', "updated_at" = '2014-06-15 04:56:14.339146' WHERE "movies"."id" = 1
---
  def update
    @movie = Movie.find params[:id]
    @movie.update_attributes!(params[:movie])

SELECT "movies".* FROM "movies" WHERE "movies"."id" = 1 LIMIT 1
SELECT "movies".* FROM "movies" WHERE "movies"."director" = 'George Lucas'
---
  def similar
    movie = Movie.find_by_id(params[:movie_id])
    if movie and movie.director != ""
      @director = movie.director
      @movies = Movie.find_by_director(movie.director)